// тут можна писати js код

// однорядковий коментар

/*
  багаторядковий 
  коментар
*/

// тип даних String
'приклад тексту';
"приклад тексту";
`приклад тексту`;



// тип даних Number
10;
-50;
7.23;
0;

// тип даних BigInt
1000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000n;

// тип даних Boolean
true;
false;

// тип даних null (пусте значення)
null;

// тип даних undefined (відсутність значення)
undefined;

// тип даних Symbol
// new Symbol('приклад символу');

// функція
// alert('якісь вхідні дані');
// console.log(10);
// console.log('10');
// console.log('test string');

// змінні
// створення пустої змінної (оголошення змінної)
let age;

// присвоєння значення змінній
age = 50;

console.log(age);

// ініціалізація змінної (оголошення + присвоєння одразу)
let otherUserAge = 99;

console.log(otherUserAge);
